class Constants {
  static const List<String> collectionsGroupsTitles = [
    'الكنب الستة',
    'الكنب التسعة',
    'كتب اخري'
  ];
  static const List<String> explanationGroupsTitles = [
    'sahihAlBukhari',
    'sahihMuslim',
    'sunanAnNasai',
    'sunanAbiDawud',
    'jamiAtTirmidhi',
    'sunanIbnMajah',
    'muwattaMalik',
    'musnadAhmad',
  ];
}

const List booksList = [
  {
    'name': 'صحيح البخاري',
    'arAndEnName': 'صحيح البخاري - Sahih al-Bukhari',
    'bookName': 'bukhari',
    'bookNumber': '0',
    'details':
        '"الجامع الصَّحيح المسنَد مِن حديث رسول الله صلى الله عليه وسلم وسننه وأيَّامه"، ينظر: مقدِّمة ابن الصلاح في علوم الحديث (1/ 26)، وفتح الباري؛ لابن حجر (1/ 8).\n• وقد اعتنى الإمامُ البخاري رحمه الله في تأليفه للجامع الصَّحيح عنايةً بالغة، قال البخاري رحمه الله: "صنَّفتُ الجامعَ من ستمائة ألف حديث في ست عشرة سنة، وجعلتُه حجَّةً فيما بيني وبين الله"، ينظر: تاريخ الإسلام؛ للذَّهبي (6/ 147).\n• وعدد أحاديث صحيح البخاري (2500) حديث تقريبًا بدون تكرار، وعدد أحاديثه مع التكرار (7563).\n• وقد رتَّب البخاريُّ صحيحَه ترتيبًا عَجيبًا في كُتب متنوعة تندرج تحتها أبوابٌ كثيرة، وعدد الكتب التي عقدها البخاريُّ في صحيحه (97) كتابًا، بدأها بكتاب بَدْء الوحي، فكتاب الإيمان، فكتاب العلم، ثمَّ كتب العبادات من الوضوء والغُسل... إلخ، وتناوَل في تلك الكتب سائرَ أحكام الشرع العملية والاعتقادية، ومن الكتب التي عقدها: كتاب تفسير القرآن، وكتاب فضائل القرآن، وكتاب الأدب، وكتاب الدعوات، وكتاب الرِّقاق، وممَّا ذكره كتاب أحاديث الأنبياء، وكتاب المناقب، وكتاب أصحاب النبي صلى الله عليه وسلم، وضمنه: باب مناقب علي بن أبي طالب القرشي الهاشمي أبي الحسَن رضي الله عنه، وباب مناقب قرابة رسول الله صلى الله عليه وسلم، وباب مناقب الحَسَن والحسين رضي الله عنهما، وباب مناقب فاطمة عليها السلام، وعقَد كتاب المغازي لذِكر سيرة النبي صلى الله عليه وسلم وغزواته، ثمَّ ذكَر أخيرًا: كتاب الفِتَن، وكتاب الأحكام، وكتاب التَّمَنِّي، وكتاب أخبار الآحاد، وكتاب الاعتصام بالكتاب والسنَّة، وختم كتابَه بكتاب التوحيد.\n• وكل كتاب في صحيح البخاري يتضمَّن أبوابًا يَذكر فيها البخاري بعضَ الآيات المناسِبة للباب، ويروي في كلِّ باب عددًا من الأحاديث بإسناده، ويكرِّر غالبًا الحديثَ الواحد في أكثر من باب؛ ليستخرج منه بعضَ الأحكام الفقهية وبعضَ الفوائد المستنبَطة؛ ولذلك قال العلماء: فِقهُ البخاري في تَراجِمه؛ أي: في الأبواب التي عقَدها في صحيحه؛ فهي تدلُّ على فِقْهه وحُسْنِ استنباطه، وقد يَذكر البخاريُّ في بعض الأبواب أقوالًا لبعض الصحابة والتابعين.\n• روى الفِرَبْريُّ عن شيخه البخاري أنه قال: "ما وَضعتُ في كتابي الصَّحيح حديثًا إلَّا اغتَسلتُ قبلَ ذلك وصلَّيتُ ركعتين"؛ ينظر: تاريخ بغداد؛ للخطيب البغدادي (2/ 327).\n• ونقَل عمر بن محمد البحيري عنه أنَّه قال: "ما أَدْخلتُ فيه - يعني: كتاب صحيح البخاري - حديثًا حتى استخَرتُ اللهَ تعالى وصلَّيتُ ركعتين وتيقَّنتُ صحَّتَه"، ينظر: فتح الباري؛ لابن حجر (1/ 489).\n\n| منقول من موقع شيكة الألوكة |'
  },
  {
    'name': 'صحيح مسلم',
    'arAndEnName': 'صحيح مسلم - Sahih Muslim',
    'bookName': 'muslim',
    'bookNumber': '1',
    'details':
        'صنَّف الإمام مسلم كتبـًا كثيرة ، وأشهرها صحيحه الذي صنفه في خمس عشرة سنة ، وقد تأسى في تدوينه بالبخاري رحمه الله فلم يضع فيه إلا ما صح عنده ، وقد جمع في صحيحه روايات الحديث الواحد في مكان واحد لإبراز الفوائد الإسنادية في كتابه ، ولذلك فإنه يروي الحديث في أنسب المواضع به ويجمع طرقه وأسانيده في ذلك الموضع، بخلاف البخاري فإنه فرق الروايات في مواضع مختلفة ، فصنيع مسلم يجعل كتابه أسهل تناولاً ، حيث تجد جميع طرق الحديث ومتونه في موضع واحد ، وصنيع البخاري أكثر فقهـًا ؛ لأنه عنيَ ببيان الأحكام ، واستنباط الفوائد والنكات ، مما جعله يذكر كل رواية في الباب الذي يناسبها ، ففرق روايات الحديث ، ويرويه في كل موطن بإسناد جديد أيضا.\nوكتاب صحيح مسلم مقسم إلى كتب ، وكل كتاب يقسم إلى أبواب ، وعدد كتبه (54) كتابـًا ، أولها كتاب الإيمان وآخرها كتاب التفسير ، وعدد أحاديثه بدون المكرر نحو (4000) حديث ، وبالمكرر نحو (7275) حديثًا .\n\n| منثول من موقع إسلام ويب |'
  },
  {
    'name': 'سنن النسائي',
    'arAndEnName': 'سنن النسائي - Sunan an-Nasai',
    'bookName': 'nasai',
    'bookNumber': '2',
    'details':
        'وقد وضع النسائي كتابًا كبيرًا جدًا حافلاً عرف بالسنن الكبرى ، وهذا الكتاب (المجتبى) المشهور بسنن النسائي منتخب منه ، وقد قيل : إن اسمه (المجتنى) بالنون .\nوكتاب (المجتبى) هذا يسير على طريقة دقيقة تجمع بين الفقه وفن الإسناد ، فقد رتب الأحاديث على الأبواب ، ووضع لها عناوين تبلغ أحيانًا منزلة بعيدة من الدقة ، وجمع أسانيد الحديث الواحد في موطن واحد .\nوقد جمع النسائي في كتابه أحاديث الأحكام ، وقسمه إلى كتب ، وعدد كتبه (58) كتابـًا ، وقسم كل كتاب إلى أبواب ، ولم يفعل فعل أبي داود والترمذي في الكلام على بعض الأحاديث بالتضعيف ، كما لم يتكلم على شيء من رجال الحديث بالجرح والتعديل ، ولم ينقل شيئـًا من مذاهب فقهاء الأمصار .\nوالسبب الذي دعا أبا داود والترمذي والنسائي إلى أن يذكروا في كتبهم أحاديث معللة هو احتجاج بعض أهل العلم والفقه بها ، فيوردونها ويبينون سقمها لتزول الشبهة ، وقد اشتهر النسائي بشدة تحريه في الحديث والرجال، وأن شرطه في التوثيق شديد .\n\n| منقول من موقع إسلام ويب |'
  },
  {
    'name': 'سنن أبي داود',
    'arAndEnName': 'سنن أبي داود - Sunan Abi Dawud',
    'bookName': 'abudawud',
    'bookNumber': '3',
    'details':
        'جمع أبو داود في كتابه هذا جملة من أحاديث رسول الله صلى الله عليه وسلم ، وقد بلغت أحاديثه (5274) حديثـًا ، وكتابه السنن صنفه وانتقاه من خمسمائة ألف حديث .\nوقد وجه أبو داود همه في هذا الكتاب إلى جمع الأحاديث التي استدل بها الفقهاء ، ودارت بينهم ، وبنى عليها الأحكام علماء الأمصار ، وتسمى هذه الأحاديث أحاديث الأحكام وقد قال المؤلف في رسالته لأهل مكة : فهذه الأحاديث أحاديث السنن كلها في الأحكام ، فأما أحاديث كثيرة في الزهد والفضائل ، وغيرها من غير هذا فلم أخرجها .\nوقد رتب كتابه على الكتب ، وقسم كل كتاب إلى أبواب ، وترجم على كل حديث بما قد استنبط منه عالم وذهب إليه ذاهب ، وعدد كتبه خمسا وثلاثين كتابـًا ، ومجموع عدد أبوابه (1871) بابـًا .\n\n| منقول من موقع إسلام ويب |'
  },
  {
    'name': 'جامع الترمذي',
    'arAndEnName': 'جامع الترمذي - Jami` at-Tirmidhi',
    'bookName': 'tirmidhi',
    'bookNumber': '4',
    'details':
        'وقد عني بجمع أحاديث الأحكام كما فعل أبو داود، ولكنه بين الحديث الصحيح من الضعيف ، وذكر مذاهب الصحابة والتابعين وفقهاء الأمصار .\nوذكر الشيخ أحمد محمد شاكر ، في مقدمة تحقيقه لسنن الترمذي أن كتاب الترمذي هذا يمتاز بثلاثة أمور لا تجدها في شيء من كتب السنة ، الأصول الستة أو غيرها :\nأولها : أنه يختصر طرق الحديث اختصارًا لطيفـًا ، فيذكر واحدًا ويومئ إلى ما عداه ، يقول  الشيخ أحمد شاكر : " بعد أن يروي الترمذي حديث الباب يذكر أسماء الصحابة الذين رويت عنهم أحاديث في هذا الباب ، سواءً أكانت بمعنى الحديث الذي رواه ، أم بمعنى آخر ، أم بما يخالفه ، أم بإشارة إليه ولو من بعيد " ، ولا شك أن هذا يدل على إطلاع واسع وحفظ عظيم.\nثانيـها : أنه في أغلب أحيانه يذكر اختلاف الفقهاء وأقوالهم في المسائل الفقهية ، وكثيرًا ما يشير إلى دلائلهم ، ويذكر الأحاديث المتعارضة في المسألة ، وهذا المقصد من أعلى المقاصد وأهمها ، فإن الغاية من علوم الحديث ، تمييز الصحيح من الضعيف ، للاستدلال والاحتجاج ، ثمَّ الاتباع والعمل .\nثالثـها : أنه يُعْنَي كل العناية في كتابه بتعليل الحديث ، فيذكر درجته من الصحة أو الضعف ، ويفصل القول في التعليل والرجال تفصيلاً جيدًا ، وبذلك صار كتابه هذا كأنه تطبيق عملي لقواعد علوم الحديث ، خصوصـًا علم العلل وصار أنفع كتاب للعالم والمتعلم ، وللمستفيد والباحث في علوم الحديث .\nيقول الشوكاني مثنيـًا على سنن الترمذي : كتاب الترمذي أحسن الكتب وأكثرها فائدة ، وأحكمها ترتيبـًا ، وأقلها تكرارًا ، وفيه ما ليس في غيره من المذاهب ووجوه الاستدلال ، والإشارة إلى ما في الباب من الأحاديث ، وتبيين أنواع الحديث : من الصحة والحسن والغرابة والضعف ، وفيه جرح وتعديل .\nومما امتاز به الكتاب كثرة فوائده العلمية وتنوعها ، وفي ذلك يقول ابن رُشَيد : " إن كتاب الترمذي تضمن الحديث مصنفًا على الأبواب وهو علم برأسه ، والفقه وهو علم ثان ، وعلل الحديث ويشتمل على بيان الصحيح من السقيم وما بينهما من المراتب وهو علم ثالث ، والأسماء والكنى وهو علم رابع ، والتعديل والتجريح وهو علم خامس ، ومن أدرك النبي صلى الله عليه وسلم ومن لم يدركه ممن أسند عنه في كتابه وهو علم سادس ، وتعديد من روى ذلك وهو علم سابع ، هذه علومه المجملة ، وأما التفصيلية فمتعددة ، وبالجملة فمنفعته كثيرة ، وفوائده غزيرة " .\nوكتابه الجامع المشهور بـسنن الترمذي يعتبر من أهم مصادر الحديث الحسن ، قال ابن الصلاح : كتاب أبي عيسى الترمذي رحمه الله أصل في معرفة الحديث الحسن وهو الذي نوه باسمه وأكثر من ذكره في جامعه ، ويبلغ عدد أحاديث جامع الترمذي (3956) حديثاً .\n\n| منقول من موقع إسلام ويب |'
  },
  {
    'name': 'سنن ابن ماجه',
    'arAndEnName': 'سنن ابن ماجه - Sunan Ibn Majah',
    'bookName': 'ibnmajah',
    'bookNumber': '5',
    'details':
        'قال الصنعاني عن ابن ماجه: وكان أحد الأعلام، وألف السنن، وليست لها رتبة ما أُلّف مِنْ قَبْلِه، لأن فيها أحاديث ضعيفة بل منكرة، ونقل عن الحافظ المزي أن غالب ما تفرد به الضعيف.\nوقد اعتُبِر هذا الكتاب رابع السنن، ومتمم الكتب الستة التي هي المراجع الأصول للسنة النبوية، وكان المتقدمون يعدونها خمسة، ليس فيها كتاب ابن ماجه، ثم جعل بعضهم الموطأ سادسها، ولما رأى بعض الحفاظ كتابه كتابًا مفيدًا قوي النفع في الفقه ورأى من كثرة زوائده أدرجه في الأصول وجعلوه آخرها منزلة؛ وذلك لأنه تفرد بأحاديث عن رجال متهمين بالكذب.\nومما تقدم نعلم أن إطلاق الصحيح على أحد كتب السنن الأربعة أو عليها مجتمعة مع الصحيحين فيه تساهل، لأن أحاديث الأربعة ليست كلها صحيحة، نعم أكثرها صحيح أو حسن، وربما كان ذلك سبب إطلاق الصحاح عليها من باب التغليب.\n\n| منقول من موقع إسلام ويب |'
  },
  {
    'name': 'موطأ مالك',
    'arAndEnName': 'موطأ مالك - Muwatta Malik',
    'bookName': 'malik',
    'bookNumber': '6',
    'details':
        'أول كتاب حديث وصل إلينا كاملاً ومرتبًا على أبواب العلم هو موطأ الإمام مالك رحمه الله ، وقد وضع الله له القبول في نفوس الناس ، والموطأ من أجل الكتب التي ألفت في عصر الإمام مالك وأعمها نفعًا ، وقد فضله الشافعي على كل ما صُنِّف في الحديث إلى وقته ، حيث قال : ما على أديم الأرض بعد كتاب الله أصح من موطأ مالك .\nولعل الإمام مالك هو أسبق علماء الحديث في وضع ما عرف بفن الحديث ، فإنه لا يكاد يعرف من سبقه في نقد الرواة والتشدد في الأخذ عن الرواة والعلماء ، وقد جمع الإمام مالك في موطئه ما صح عنده من حديث وتفسير وتاريخ ، وذكر أقوال الصحابة والتابعين والأئمة قبله.\nتأتي مرتبة الموطأ بعد الصحيحين - صحيح البخاري وصحيح مسلم - في الصحة في رأي جمهور المحدِّثين .\nعني الإمام مالك بالموطأ عناية فائقة حتى قالوا : إنه مكث فيه أربعين سنة ينقحه ويهذبه ، وقد أخذه عنه الأوزاعي في أربعين يومـًا ، فقال مالك : كتاب ألفته في أربعين سنة أخذتموه في أربعين يومـًا ، ما أقل ما تفقهون فيه .\nقال مالك : عرضت كتابي هذا على سبعين فقيهـًا من فقهاء المدينة ، فكلهم واطأني عليه فسميته الموطأ ، فقيل لهذا سمي الموطأ ، وقيل إنه سُمي الموطأ ، لأن المنصور قال له : وطئه للناس أي اجعله سهل التناول ، والموطأ أي الممهد المنقح .\nوقد روى الموطأ عن مالك بغير واسطة أكثر من ألف رجل ، وضرب الناس فيه أكباد الإبل من أقاصي البلاد ، منهم الأئمة المبرزون ، ومنهم الفقهاء المجتهدون ، ومنهم الملوك والأمراء كالرشيد وابنيه .\n\n| منقول من موقع إسلام ويب |'
  },
  {
    'name': 'مسند أحمد',
    'arAndEnName': 'مسند أحمد - Musnad Ahmad',
    'bookName': 'ahmad',
    'bookNumber': '7',
    'details':
        'وضع الإمام أحمد هذا الكتاب ليكون مرجعًا للمسلمين وإمامًا وجعله مرتبًا على أسماء الصحابة الذين يروون الأحاديث كما هي طريقة المسانيد ، فجاء كتابًا حافلاً كبير الحجم ، يبلغ عدد أحاديثه أربعين ألفًا تقريبًا ، تكرر منها عشرة آلاف حديث ومن أحاديثه ثلاثمائة حديث ثلاثية الإسناد - أي بين راويها وبين النبي صلى الله عليه وسلم ثلاثة رواة -.\nوقد رتب كتابه على المسانيد فجعل مرويات كل صحابي في موضع واحد ، وعدد الصحابة الذين لهم مسانيد في مسند الإمام أحمد (904) صحابي .\nكان الإمام أحمد يحفظ ألف ألف حديث عن ظهر قلب ، وقد انتقى المسند من هذا العدد الهائل من محفوظه ، ولم يدخل فيه إلاَّ ما يحتج به ، وبالغ بعضهم ، فأطلق أن جميع ما فيه صحيح ، وقد زعم بعض العلماء أن بعض الأحاديث فيه موضوعة ، قال بعضهم هي تسعة أحاديث ، وقال آخرون هي خمسة عشر .\nقال شيخ الإسلام ابن تيمية في كتاب منهاج السنة : " شرط أحمد في المسند أنه لا يروي عن المعروفين بالكذب عندهم ، وإن كان في ذلك ما هو ضعيف.. إلى أن قال : زاد ابن الإمام زيادات على المسند ضمت إليه ، وكذلك زاد القطيعي وفي تلك الزيادات كثير من الأحاديث الموضوعات ، فظن من لا علم عنده أن ذلك من رواية الإمام أحمد في مسنده " .\nوقد ألف الحافظ ابن حجر كتابًا سماه " القول المسدد في الذب عن المسند " حقق فيه نفي الوضع عن أحاديث المسند وظهر من بحثه أن غالبها جياد وأنه لا يتأتى القطع بالوضع في شيء منها بل ولا الحكم بكون واحد منها موضوعًا إلا الفرد النادر مع الاحتمال القوي في دفع ذلك .\nوقال السيوطي في خطبة كتابه الجامع الكبير ما لفظه : " وكل ما كان في مسند أحمد فهو مقبول ، فإن الضعيف فيه يقرب من الحسن " .\n\n | منقول من موقع إسلام ويب |'
  },
  {
    'name': 'سنن الدارمي',
    'arAndEnName': 'سنن الدارمي - Sunan ad-Darimi',
    'bookName': 'darimi',
    'bookNumber': '8',
    'details': ''
  },
  {
    'name': 'الأربعون النووية',
    'arAndEnName': 'الأربعون النووية - Forty Hadith of an-Nawawi',
    'bookName': 'forty',
    'bookNumber': '9',
    'details':
        'يعتبر كتاب (الأربعون النووية) فريدًا بخصائصه ومميزاته، وهو من أبرز الكتب، فقد جمع فيها أربعين حديثًا نبوية تتضمَّن جوامعَ كلمه صلى الله عليه وسلم، وهو خزانة للأحكام الشرعية، وكنز لقواعد الإسلام، ونبراس للفقه الإسلامي.\nوقد سبق النووي عددٌ من العلماء في تأليف أربعين حديثًا، فقد ركَّز بعضُهم على أحاديث أصول الدين، وبعضهم في الزهد... فقد أشار النووي إلى ذلك؛ حيث قال: "من العلماء مَن جمع الأربعين في أصول الدين، وبعضهم في الفروع، وبعضهم في الجهاد، وبعضهم في الزهد، وبعضهم في الآداب، وبعضهم في الخطب، وكلها مقاصد صالحة رضي الله عن قاصديها، وقد رأيت جمع أربعين أهم من هذا كله، وهي أربعون حديثًا مشتملة على جميع ذلك، وكل حديث منها قاعدة عظيمة من قواعد الدين، وقد وصفه العلماء بأن مدار الإسلام عليه أو هو نصف الإسلام، أو ثلثه أو نحو ذلك"\nوقد أشار النووي إلى أهمية هذا الكتاب؛ حيث قال: "وينبغي لكل راغب في الآخرة أن يعرف هذه الأحاديث، لِما اشتملت عليه من المهمات، واحتوت عليه من التنبيه على جميع الطاعات وذلك ظاهر لمن تدبَّره، وعلى الله اعتمادي، وإليه تفويضي واستنادي، وله الحمد والنعمة، وبه التوفيق والعصمة"\n\n| منقول من موقع شبكة الألوكة |'
  },
  {
    'name': 'رياض الصالحين',
    'arAndEnName': 'رياض الصالحين - Riyad as-Salihin',
    'bookName': 'riyadussalihin',
    'bookNumber': '10',
    'details':
        'هذا الكتاب الذي يتضمَّن (نفحات تربويَّة عبقة الشَّذى فوَّاحة الأريج، تهذِّب الرُّوح، وتسمو بها، وتولد فيها حافزًا قويًّا على التحلِّي بما خُلقت له من العبادة، وتصل بها إلى ما فيه إسعادها وصلاح أمرها؛ وذلك لما اشتمل عليه من ترغيب وترهيب، وطهارات للقلوب وعلاجها، وصيانة الجوارح وتقويم اعوجاجها، وغير ذلك من المقاصد التي يحتاج إليها المكلَّف الفطِن الذي يهمُّه أمر دينه ودنياه وآخرته، فهو كتابٌ تربويٌّ فذٌّ، تناول مختلف جوانب الحياة الفرديَّة والاجتماعيَّة بأسلوبٍ واضحٍ، يُدرك مرماه الخاصُّ والعامُّ، والمثقَّف ومَن دونه، ذلك لأنَّه لغة أفصح الخلق الذي تنزَّل القرآن على قلبه ليكون للعالمين بشيرًا ونذيرًا)'
  },
  {
    'name': 'مشكاة المصابيح',
    'arAndEnName': 'مشكاة المصابيح - Mishkat al-Masabih',
    'bookName': 'mishkat',
    'bookNumber': '11',
    'details':
        'مشكاة المصابيح أصله كتاب مصابيح السنة للبغوي، وهو كتاب جمع فيه صاحبه متون الأحاديث، وقام بترتيبها على طريقة كتب الجوامع، مع الحكم عليها بالصحة أو الحسن أو غيرها، فجاء كتابه مشتملا على أحاديث العقائد والعلم والعبادات والمعاملات والآداب والرقائق والفتن والفضائل والمناقب، لكنه يختلف عن الجوامع في خلوه من كتابي التفسير والمغازي .\nوالخطيب التبريزي رحمه الله صاحب المشكاة كان معجبا بـ المصابيح حتى إنه قال عنه وكان كتاب المصابيح الذي صنفه الإمام محيي السنة وقامع البدعة أبو محمد الحسين بن مسعود الفراء البغوي رفع الله درجته أجمع كتاب صنف في بابه، وأضبط لشوارد الأحاديث وأوابدها .\nولكنه مع إعجابه بالمصابيح رأى أنها بحاجة لاستدراك، فألف مشكاة المصابيح، وقام بتخريج أحاديثه، وذكر اسم الصحابي الراوي للحديث ؛ لأن البغوي لم يكن يذكر ذلك غالبا، وزاد فصلا ثالثا في كل باب. وقد قسم رحمه الله كل باب إلى فصول ثلاثة :\nالأول : ما أخرجه الشيخان أو أحدهما .\nالثاني : ما أورده غيرهما من الأربعة وأصحاب المسانيد والسنن.\nالثالث : ما اشتمل على معنى الباب من أحاديث وإن كانت موقوفة.\n\n| منقول من موقع إسلام ويب |'
  },
  {
    'name': 'الأدب المفرد',
    'arAndEnName': 'الأدب المفرد - Al-Adab Al-Mufrad',
    'bookName': 'adab',
    'bookNumber': '12',
    'details':
        'كتاب "الأدب المفرد" وضعه الإمام البخاري حيث يتناول الكتاب الآداب الإسلامية المفردة الواردة في السنة النبوية، وضمن الكتاب بعض أقوال الصحابة والتابعين. وقد ذكر ابن حجر أنه "يشتمل على أحاديث زائدة على ما في الصحيح، وفيه قليل من الآثار الموقوفة، وهو كثير الفائدة"، ويتضمن الكتاب 1322 حديثًا موزعة على 644 بابًا، وأحاديث الكتاب يغلب عليها الصحة، وسبب عدم كونها كلها صحيحة أن البخاري لا يلتزم في هذا الكتاب شروطه في كتاب الصحيح لأن الأحاديث أحاديث آداب وليست أحاديث أحكام.\nوكتاب "الأدب المفرد" فريد في نوعه، يجمع الآداب الإسلامية، وهو موسوعة إسلامية في الآداب، فيه الآداب الشرعية الواردة في السنة النبوية. وقد جمع فيه ما يحتاجه المسلم من العقائد وأصول الدين والعلم وحقوق الناس ودلائل النبوة والزهد والرقائق.\nونجد أن الإمام البخاري تمسك في تألفيه بأسلوب كتابه "الجامع الصحيح"، وبوب فيه الأحاديث حسب مواضيعها وآثار الصحابة، وأورد عند بعض الأحاديث آيات من القرآن الكريم.\n\n| منقول من موقع شبكة الألوكة |'
  },
  {
    'name': 'الشمائل المحمدية',
    'arAndEnName': 'الشمائل المحمدية - Ash-Shamail Al-Muhammadiyah',
    'bookName': 'shamail',
    'bookNumber': '13',
    'details':
        'كتاب (الشمائل المحمدية) للإمام الترمذيِّ المتوفى عام (279هـ) كتابٌ شهير عند العلماء، أراد مؤلفه تعريف المسلمين بالصفات الخَلقية والخُلقية لنبيهم محمد عليه الصلاة والسلام، ويعتبر من أوائل ما صُنِّف في شمائلِ الرسول صلى الله عليه وسلم، وتلقاه العلماء بالحفاوة والعناية، فتناولوه بالإقراء والمدارس والشرح والنظم والاختصار.\n\n| منقول من موقع شبكة الألوكة |'
  },
  {
    'name': 'بلوغ المرام',
    'arAndEnName': 'بلوغ المرام - Bulugh al-Maram',
    'bookName': 'bulugh',
    'bookNumber': '14',
    'details':
        'لقد اشتَملَ كتابُ "بلوغ المرام من أدلة الأحكام"؛ للإمام الحافظ أبي الفضل أحمد بن عليِّ بن محمد الكناني الشافعي، المعروف بابن حجرٍ العسقلاني، المتوفَّى سنة (852 هـ) على أصولِ الأدلَّة الحديثيَّة للأحكام الشرعيَّة؛ فقد حرَّرَه ابنُ حجرٍ- رحمه الله- تحريرًا بالغًا؛ ليكون بدايةً للطريق للطالب المبتدئ، واستزادةً لِمَن وصَل في هذا العِلم إلى أعْلى الدرجات.\nويتَّضح ذلك ممَّا قاله ابنُ حجرٍ نفسُه في مقدمة كتابه، حيث قال: "أمَّا بعدُ، فهذا مختصَرٌ يشتمِل على أصولِ الأدلَّة الحديثيَّة للأحكام، حرَّرتُه تحريرًا بالغًا؛ ليصيرَ مَن يحفَظُه مِن بيْن أقرانه نابِغًا، ويَستعين به الطالِبُ المبتدِي، ولا يَستغني عنه الراغبُ المنتهي".\nومن هنا جاءتْ أهميَّة الكتاب، فهو يُعَدُّ مِن أهم كتب الأحكام، بل يصل إلى درجةِ النفائس.\nوقد اتَّبَع ابن حجرٍ- رحمه الله- في ترتيبه لكتابه طريقةَ الفُقَهاء في ترتيبهم لكُتُب الفِقه؛ حيث بدأ كتابَه كعادة المتقدِّمين بالطهارة، ثم الصلاة، ثم الجنائز، ثم الزكاة، ثم الصيام، ثم الحج، ثم البيوع، ثم النكاح، ثم الجنايات، ثم الحدود، ثم الجهاد، ثم الأطعمة، وجعَل آخِرَه بابًا جامعًا سمَّاه: الجامِع في الآداب، حيث ضمَّنه نُخبةً طيِّبة مِنَ الأحاديث في الأخلاق والسلوك، والذِّكر والدعاء.\nوقد اهتَمَّ ابنُ حجرٍ بتوضيح درجةِ الحديث من حيثُ الصحةُ والضعْف، وكثيرًا ما كان يُصدِّر الباب الذي يتناوَله بما في الصحيحين أو أحدهما، وإذا كان للحديثِ مُتابعاتٌ أو شواهِدُ أشارَ إليها.\nوقدِ اشتَملَ الكتاب على "1596" حديثًا، وهو عددٌ كبير أعْطَى الكتاب ثقلاً من حيثُ الأهميَّة، وربَّما كان السببُ في زيادة عددِ الأحاديث في هذا الكتاب هو أنَّ ابن حجرٍ كان يُورِد كلَّ ما في الباب الذي يَتناوَله من أحاديثَ، مع بيانِ الضعيف، وهذا على عكسِ كتاب "الإلمام"؛ لابن دقيق، حيث اشترَط مؤلِّفه ألاَّ يورد إلا ما صَحَّ.\n\n| منقول من شبكة الألوكة |'
  },
];

List<String> images = <String>[
  'assets/images/onboarding/onboarding1.png',
  'assets/images/onboarding/onboarding2.png',
  'assets/images/onboarding/onboarding3.png',
  'assets/images/onboarding/onboarding4.png',
  'assets/images/onboarding/onboarding4.png',
];

List<String> imagesL = <String>[
  'assets/images/onboarding/onboarding1.png',
  'assets/images/onboarding/onboarding2.png',
  'assets/images/onboarding/onboarding3.png',
  'assets/images/onboarding/onboarding4.png',
];

List<String> imagesD = <String>[
  'assets/images/onboarding/onboarding1.png',
  'assets/images/onboarding/onboarding2.png',
  'assets/images/onboarding/onboarding3.png',
  'assets/images/onboarding/onboarding4.png',
];

List<String> onboardingTitle = <String>[
  'onboarding1',
  'onboarding3',
  'onboarding2',
  'onboarding5',
  'onboarding4',
  'onboarding6',
];

List<String> rtlLang = <String>['العربية', 'עברית', 'فارسی', 'اردو', 'کوردی'];

List<Map<String, dynamic>> translateList = [
  {'name': 'English', 'langCode': 'en'},
  {'name': 'اردو', 'langCode': 'ur'},
  {'name': 'বাংলা', 'langCode': 'bn'},
];

const List monthHadithsList = [
  {
    'hadithPart1':
        'عَنْ أَبِي هُرَيْرَةَ، - رضى الله عنه - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم',
    'hadithPart2':
        '"‏ أَفْضَلُ الصِّيَامِ بَعْدَ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمُ وَأَفْضَلُ الصَّلاَةِ بَعْدَ الْفَرِيضَةِ صَلاَةُ اللَّيْلِ ‏"‏ ‏.‏',
    'bookName': ' صحيح مسلم كتاب الصيام - ٤٠٤',
  },
  {
    'hadithPart1':
        ' كَانَ أَصْحَابُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَتَعَلَّمُونَ هَذَا الدُّعَاءَ كَمَا يَتَعَلَّمُونَ القُرآنَ إِذَا دَخَل الشَّهْرُ أَوِ السَّنَةُ: ',
    'hadithPart2':
        'اللَّهُمَّ أَدْخِلْهُ عَلَيْنَا بِالْأَمْنِ، وَالْإِيمَانِ، وَالسَّلَامَةِ، وَالْإِسْلَامِ، وَجوار مِنَ الشَّيْطَانِ، وَرِضْوَانٍ مِنَ الرَّحْمَنِ ".',
    'bookName': ' صححه الحافظ ابن حجر في "الإصابة" ٦ / ٤٠٧ - ٤٠٨',
  },
  {
    'hadithPart1': '',
    'hadithPart2': '',
    'bookName': '',
  },
  {
    'hadithPart1': '',
    'hadithPart2': '',
    'bookName': '',
  },
  {
    'hadithPart1': '',
    'hadithPart2': '',
    'bookName': '',
  },
  {
    'hadithPart1': '',
    'hadithPart2': '',
    'bookName': '',
  },
  {
    'hadithPart1':
        'عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ',
    'hadithPart2':
        '"‏ الزَّمَانُ قَدِ اسْتَدَارَ كَهَيْئَتِهِ يَوْمَ خَلَقَ السَّمَوَاتِ وَالأَرْضَ، السَّنَةُ اثْنَا عَشَرَ شَهْرًا، مِنْهَا أَرْبَعَةٌ حُرُمٌ، ثَلاَثَةٌ مُتَوَالِيَاتٌ ذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ، وَرَجَبُ مُضَرَ الَّذِي بَيْنَ جُمَادَى وَشَعْبَانَ ‏"‏‏.‏',
    'bookName': ' صحيح البخاري كتاب بدء الخلق - ٣١٩٧',
  },
  {
    'hadithPart1': 'عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ',
    'hadithPart2':
        '"كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ حَتَّى نَقُولَ لاَ يُفْطِرُ، وَيُفْطِرُ حَتَّى نَقُولَ لاَ يَصُومُ‏.‏ فَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَكْمَلَ صِيَامَ شَهْرٍ إِلاَّ رَمَضَانَ، وَمَا رَأَيْتُهُ أَكْثَرَ صِيَامًا مِنْهُ فِي شَعْبَانَ‏.‏"',
    'bookName': ' صحيح البخاري كتاب الصوم - ١٩٦٩',
  },
  {
    'hadithPart1':
        'عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ',
    'hadithPart2':
        '"‏ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏"‏‏.‏',
    'bookName': ' صحيح البخاري كتاب الإيمان - ٣٧',
  },
  {
    'hadithPart1':
        'عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، - رضى الله عنه - أَنَّهُ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ',
    'hadithPart2':
        '"‏ مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ سِتًّا مِنْ شَوَّالٍ كَانَ كَصِيَامِ الدَّهْرِ ‏"‏ ‏.‏',
    'bookName': ' صحيح مسلم كتاب الصيام - ٤٠٤',
  },
  {
    'hadithPart1':
        'عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ سُئِلَ عَنْ مُتْعَةِ الْحَجِّ، فَقَالَ أَهَلَّ الْمُهَاجِرُونَ وَالأَنْصَارُ وَأَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ وَأَهْلَلْنَا، فَلَمَّا قَدِمْنَا مَكَّةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم',
    'hadithPart2':
        '"‏ اجْعَلُوا إِهْلاَلَكُمْ بِالْحَجِّ عُمْرَةً إِلاَّ مَنْ قَلَّدَ الْهَدْىَ ‏"‏‏.‏ فَطُفْنَا بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ وَأَتَيْنَا النِّسَاءَ، وَلَبِسْنَا الثِّيَابَ وَقَالَ ‏"‏ مَنْ قَلَّدَ الْهَدْىَ فَإِنَّهُ لاَ يَحِلُّ لَهُ حَتَّى يَبْلُغَ الْهَدْىُ مَحِلَّهُ ‏"‏‏.‏ ثُمَّ أَمَرَنَا عَشِيَّةَ التَّرْوِيَةِ أَنْ نُهِلَّ بِالْحَجِّ، فَإِذَا فَرَغْنَا مِنَ الْمَنَاسِكِ جِئْنَا فَطُفْنَا بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ فَقَدْ تَمَّ حَجُّنَا، وَعَلَيْنَا الْهَدْىُ كَمَا قَالَ اللَّهُ تَعَالَى ‏{‏فَمَا اسْتَيْسَرَ مِنَ الْهَدْىِ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاَثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعْتُمْ‏}‏ إِلَى أَمْصَارِكُمْ‏.‏ الشَّاةُ تَجْزِي، فَجَمَعُوا نُسُكَيْنِ فِي عَامٍ بَيْنَ الْحَجِّ وَالْعُمْرَةِ، فَإِنَّ اللَّهَ تَعَالَى أَنْزَلَهُ فِي كِتَابِهِ وَسَنَّهُ نَبِيُّهُ صلى الله عليه وسلم وَأَبَاحَهُ لِلنَّاسِ غَيْرَ أَهْلِ مَكَّةَ، قَالَ اللَّهُ ‏{‏ذَلِكَ لِمَنْ لَمْ يَكُنْ أَهْلُهُ حَاضِرِي الْمَسْجِدِ الْحَرَامِ‏}‏ وَأَشْهُرُ الْحَجِّ الَّتِي ذَكَرَ اللَّهُ تَعَالَى شَوَّالٌ وَذُو الْقَعْدَةِ وَذُو الْحَجَّةِ، فَمَنْ تَمَتَّعَ فِي هَذِهِ الأَشْهُرِ فَعَلَيْهِ دَمٌ أَوْ صَوْمٌ، وَالرَّفَثُ الْجِمَاعُ، وَالْفُسُوقُ الْمَعَاصِي، وَالْجِدَالُ الْمِرَاءُ‏.‏',
    'bookName': ' صحيح البخاري كتاب الحج - ١٥٧٢',
  },
  {
    'hadithPart1':
        'أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، عَنْ أَبِيهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ',
    'hadithPart2':
        '"‏ شَهْرَانِ لاَ يَنْقُصَانِ شَهْرَا عِيدٍ رَمَضَانُ وَذُو الْحَجَّةِ ‏"‏‏.‏',
    'bookName': ' صحيح البخاري كتاب الصوم - ١٩١٢',
  },
];
