const String quranLove =
    '''

1 - ثبت في صحيح ابن حبان عن أبي شريح الخزاعي رضي الله عنه قال: ((خرج علينا رسول الله صلى الله عليه وسلم فقال: أبشروا وأبشروا أليس تشهدون أن لا إله إلا الله وأني رسول الله؟ قالوا: نعم، قال: فإن هذا القرآن سبب طرفه بيد الله وطرفه بأيديكم فتمسكوا به، فإنكم لن تضلوا ولن تهلكوا بعده أبدًا)).

2 - عن عمران بن حصين رضي الله عنه أنه مر على قاص يقرأ، ثم سأل فاسترجع، ثم قال: سمعت رسول الله صلى الله عليه وسلم يقول: ((من قرأ القرآن فليسأل الله به فإنه سيجيء أقوام يقرؤون القرآن يسألون به الناس)).

3 - عن جابر بن عبد الله رضي الله عنه قال: خرج علينا رسول الله صلى الله عليه وسلم ونحن نقرأ القرآن وفينا الأعرابي والأعجمي فقال: ((اقرؤوا فكل حسن وسيجيء أقوام يقيمونه كما يقام القدح يتعجلونه ولا يتأجلونه)).

4 - عن أبو هريرة رضي الله عنه قال: ((حدثني رسول الله صلى الله عليه وسلم أن الله عز وجل إذا كان يوم القيامة نزل إلى العباد ليقضي بينهم وكل أمة جاثية فأول من يدعو به رجل جمع القرآن ورجل يقتل في سبيل الله ورجل كثير المال فيقول الله للقارئ: ألم أعلمك ما أنزلت على رسولي، قال: بلى يا رب، قال: فماذا عملت فيما علمت، قال: كنت أقوم به آناء الليل وآناء النهار فيقول الله له كذبت، وتقول الملائكة له: كذبت، فيقول الله عز وجل: أردت أن يقال: فلان قارئ فقد قيل، ويؤتى بصاحب المال فيقول: ألم أوسع عليك حتى لم أدعك تحتاج إلى أحد، قال: بلى، قال: فماذا عملت فيما آتيتك، قال: كنت أصل الرحم وأتصدق، فيقول الله: كذبت، وتقول الملائكة كذبت، ويقول الله: بل أردت أن يقال: فلان جواد فقد قيل ذلك، ويؤتى بالرجل الذي قتل في سبيل الله فيقال له: فيم قتلت، فيقول: أمرت بالجهاد في سبيلك فقاتلت حتى قتلت، فيقول الله: كذبت، وتقول الملائكة له: كذبت ويقول الله: بل أردت أن يقال: فلان جريء فقد قيل ذلك، ثم ضرب رسول الله صلى الله عليه وسلم على ركبتي فقال: يا أبا هريرة أولئك الثلاثة أول خلق الله تسعر بهم النار يوم القيامة)).

5 - عن أبي سعيد الخدري رضي الله عنه أن رجلا جاءه، فقال: أوصني، فقال: ((سألتني عما سألت عنه رسول الله صلى الله عليه وسلم من قبلك، أوصيك بتقوى الله فانه رأس كل شيء، وعليك بالجهاد فإنها رهبانية الاسلام، وعليك بذكر الله وتلاوة القرآن فانه روحك في السماء وذكرك في الأرض)).

6 - عن أبي مالك الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: ((الطهور شطر الإيمان، والحمد لله تملأ الميزان، وسبحان الله والحمد لله تملآن أو تملأ ما بين السماوات والأرض، والصلاة نور، والصدقة برهان، والصبر ضياء، والقرآن حجة لك أو عليك، كل الناس يغدو فبايع نفسه فمعتقها أو موبقها)).

7 - عن أبي موسى الأشعري رضي الله عنه عن النبي صلى الله عليه وسلم قال: ((مثل الذي يقرأ القرآن كالأترجة طعمها طيب، وريحها طيب، والذي لا يقرأ القرآن كالتمرة طعمها طيب، ولا ريح لها، ومثل الفاجر الذي يقرأ القرآن كمثل الريحانة ريحها طيب، وطعمها مر، ومثل الفاجر الذي لا يقرأ القرآن كمثل الحنظلة طعمها مر، ولا ريح لها)).

8 - عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: ((من قرأ حرفا من كتاب الله فله به حسنة والحسنة بعشر أمثالها، لا أقول ألم حرف ولكن ألف حرف، ولام حرف، وميم حرف)).

9 - عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: ((إن لله أهلين من الناس، قالوا يا رسول الله: من هم، قال: هم أهل القرآن أهل الله وخاصته)).

10 - عن أبو أمامة الباهلي رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: ((اقرؤوا القرآن فإنه يأتي يوم القيامة شفيعا لأصحابه، اقرؤوا الزهراوين البقرة وسورة آل عمران فإنهما تأتيان يوم القيامة كأنهما غمامتان، أو كأنهما غيايتان، أو كأنهما فرقان من طير صواف تحاجان عن أصحابهما، اقرؤوا سورة البقرة فإن أخذها بركة، وتركها حسرة، ولا تستطيعها البطلة... قال معاوية: بلغني أن البطلة السحرة)).

11 - عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: ((أيحب أحدكم إذا رجع إلى أهله أن يجد فيه ثلاث خلفات عظام سمان، قلنا: نعم، قال فثلاث آيات يقرأ بهن أحدكم في صلاته خير له من ثلاث خلفات عظام سمان)).

12 - عن عثمان بن عفان رضي الله عنه عن النبي صلى الله عليه وسلم قال: ((خيركم من تعلم القرآن وعلمه)).

13 - عن على رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: ((خياركم من تعلم القرآن وعلمه)).

14 - عن عبد الله بن عمرو رضي الله عنهما عن النبي صلى الله عليه وسلم قال: ((يقال لصاحب القرآن: إقرأ وارتق ورتل كما كنت ترتل في الدنيا فإن منزلتك عند آخر آية تقرؤها)).

15 - عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: ((يجيء القرآن يوم القيامة فيقول: يا رب حله، فيلبس تاج الكرامة، ثم يقول: يا رب زده، فيلبس حلة الكرامة، ثم يقول: يا رب أرض عنه فيرضى عنه، فيقال له اقرأ وارق وتزاد بكل آية حسنة)).

16 - عن عقبة بن عامر رضي الله عنه قال: خرج علينا رسول الله صلى الله عليه وسلم ونحن في الصفة فقال: ((أيكم يحب أن يغدو كل يوم بطحان أو العقيق فيأتي بناقتين كوماوين في غير إثم بالله ولا قطع رحم؟ فقلنا: يا رسول الله كلنا نحب ذلك فقال: فلئن يغدو أحدكم كل يوم إلى المسجد فيتعلم آيتين من كتاب الله عز وجل خير له من ناقتين وثلاث خير له من ثلاث وأربع خير له من أربع ومن أعدادهن من الإبل)).

17 - عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: ((ليس منا من لم يتغن بالقرآن وزاد غيره يجهر به)).

18 - عن أبي هريرة رضي الله عنه قال: بعث رسول الله صلى الله عليه وسلم بعثا وهم ذو عدد فاستقرأهم فاستقرأ كل رجل منهم ما معه من القرآن فأتى على رجل منهم من أحدثهم سنا، فقال: ما معك يا فلان قال معي كذا وكذا وسورة البقرة، قال: أمعك سورة البقرة، فقال: نعم قال فاذهب فأنت أميرهم، فقال رجل من أشرافهم: والله يا رسول الله ما منعني أن أتعلم سورة البقرة إلا خشية ألا أقوم بها، فقال رسول الله صلى الله عليه وسلم: ((تعلموا القرآن فاقرؤه وأقرئوه فإن مثل القرآن لمن تعلمه فقرأه وقام به كمثل جراب محشو مسكا يفوح بريحه كل مكان، ومثل من تعلمه فيرقد وهو في جوفه كمثل جراب وكئ على مسك)).

19 - عن سهل بن سعد رضي الله عنه قال: أتت النبي صلى الله عليه وسلم امرأة فقالت: إنها قد وهبت نفسها لله ولرسوله صلى الله عليه وسلم، فقال: ((ما لي في النساء من حاجة، فقال رجل: زوجنيها، قال: أعطها ثوبا، قال: لا أجد، قال: أعطها ولو خاتما من حديد، فاعتل له، فقال: ما معك من القرآن: قال: كذا وكذا قال: فقد زوجتكها بما معك من القرآن)).

20 - نافع بن عبد الحارث لقي عمر رضي الله عنه بعسفان، وكان عمر يستعمله على مكة فقال: من استعملت على أهل الوادي، فقال: بن أبزي، قال: ومن بن أبزي، قال: مولى من موالينا، قال: فاستخلفت عليهم مولى، قال: إنه قارئ لكتاب الله عز وجل، وإنه عالم بالفرائض، قال: عمر أما إن نبيكم صلى الله عليه وسلم قد قال: ((إن الله يرفع بهذا الكتاب أقواما ويضع به آخرين)).

21 - عن عبد الله بن مسعود رضي الله عنه قال: قال النبي صلى الله عليه وسلم: ((بئس ما لأحدهم أن يقول نسيت آية كيت وكيت بل نسي واستذكروا القرآن فإنه أشد تفصيا من صدور الرجال من النعم)).

22 - عن عقبة بن عامر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: ((تعلموا كتاب الله وتعاهدوا واقتنوه وتغنوا به فوالذي نفسي بيده لهو أشد تفلتا من المخاض في العقل)).

23 - عن بن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال: ((إنما مثل صاحب القرآن كمثل صاحب الإبل المعقلة إن عاهد عليها أمسكها وإن أطلقها ذهبت)).

24 - عن البراء بن عازب رضي الله عنه قال: سمعت رسول الله يقول: ((حسنوا القرآن بأصواتكم فإن الصوت الحسن يزيد القرآن حسنًا)).

25 - عن ابن مسعود رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: حسن الصوت زينة القرآن.

26 - عن أسيد بن حضير رضي الله عنه أنه كان يقرأ وهو على ظهر بيته، وهو حسن الصوت، فجاء رسول الله صلى الله عليه وسلم فقال: ((بينا اقرأ إذ غشيني شيء كالسحاب والمرأة في البيت والفرس في الدار فتخوفت أن تسقط المرأة وتنفلت الفرس فانصرفت فقال له رسول الله صلى الله عليه وسلم: اقرأ يا أسيد فإنما هو ملك استمع القرآن)).

27 - عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: ((لا حسد إلا في اثنتين رجل علمه الله القرآن فهو يتلوه آناء الليل وآناء النهار فسمعه جار له فقال: ليتني أوتيت مثل ما أوتي فلان فعملت مثل ما يعمل ورجل آتاه الله مالا فهو يهلكه في الحق فقال رجل ليتني أوتيت مثل ما أوتي فلان فعملت مثل ما يعمل)).

28 - عن عبد الرحمن بن شبل رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: ((تعلموا القرآن فإذا علمتموه فلا تغلوا فيه، ولا تجفوا عنه ولا تأكلوا به ولا تستكثروا به)).

29 - عن النواس بن سمعان رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: ((يؤتى يوم القيامة بالقرآن وأهلَه الذين كانوا يعملون به في الدنيا تَقدُمُهُ سورة البقرة وآل عمران، وضرب لهما رسول الله صلى الله عليه وسلم ثلاثة أمثال ما نسيتهن بعد قال كأنهما غمامتان أو ظلتان سوداوان بينهما شرق أو كأنهما حزقان من طير صواف تحاجان عن صاحبهما)).

30 - عن عبد الله بن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال: ((أقرأني جبريل على حرف فراجعته ثم لم أزل أستزيده فيزيدني حتى انتهى إلى سبعة أحرف)).

31 - عن عائشة رضي الله عنها عن النبي صلى الله عليه وسلم قال: ((الماهر بالقرآن مع السفرة الكرام البررة والذي يقرأ القرآن وهو يشتد عليه له أجران)).

32 - عن عمر بن الخطاب رضي الله عنه قال، قال رسول الله صلى الله عليه وسلم: ((من نام عن حزبه أو عن شيء منه فقرأه فيما بين صلاة الفجر وصلاة الظهر كُتِب له كأنما قرأه من الليل)).

33 - عن عبد الله بن عمرو رضي الله عنهما قال: ((قال رسول الله صلى الله عليه وسلم: إقرأ القرآن في شهر، قلت إني لأجد قوة حتى قال: إقرأه في سبع ولا تزد على ذلك)).

34 - عن عبد الله بن عمرو رضي الله عنهما قال، قال رسول الله صلى الله عليه وسلم: من قرأ القرآن في أقل من ثلاث لم يفقهه.

35 - عن بن عباس رضي الله عنهما قال: ((كان رسول الله صلى الله عليه وسلم أجود الناس، وكان أجود ما يكون في رمضان حين يلقاه جبريل وكان يلقاه في كل ليلة من رمضان فيدارسه القرآن، فلرسول الله صلى الله عليه وسلم أجود بالخير من الريح المرسلة)).

36 - عن أم سلمة رضي الله عنها قالت: ((كان رسول الله صلى الله عليه وسلم إذا قرأ قطع آية آية. الحمد لله رب العالمين، ثم يقف، الرحمن الرحيم، ثم يقف، قال بن أبي مليكة: وكانت أم سلمة تقرأها ملك)).

37 - عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: ((إن من إجلال الله إكرام ذي الشيبة المسلم، وحامل القرآن غير الغالي فيه، والجافي عنه، وإكرام ذي السلطان المقسط)).

38 - عقبة بن عامر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: ((سيخرج أقوام من أمتي يشربون القرآن كشربهم اللبن)).
 
39 - أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: ((الجدال في القرآن كفر)).

40 - عن جابر بن عبد الله رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان يجمع بين الرجلين من قتلى أحد في ثوب واحد ثم يقول: ((أيهم أكثر أخذا للقرآن، فإذا أشير له إلى أحدهما قدمه في اللحد)).
    ''';


const String quranKhatem =
    '''
    
    اللَّهُمَّ ارْحَمْنِي بالقُرْءَانِ وَاجْعَلهُ لِي إِمَاماً وَنُوراً وَهُدًى وَرَحْمَةً ۞

اللَّهُمَّ ذَكِّرْنِي مِنْهُ مَانَسِيتُ وَعَلِّمْنِي مِنْهُ مَاجَهِلْتُ وَارْزُقْنِي تِلاَوَتَهُ آنَاءَ اللَّيْلِ وَأَطْرَافَ النَّهَارِ وَاجْعَلْهُ لِي حُجَّةً يَارَبَّ العَالَمِينَ ۞

اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ ۞

اللَّهُمَّ اجْعَلْ خَيْرَ عُمْرِي آخِرَهُ وَخَيْرَ عَمَلِي خَوَاتِمَهُ وَخَيْرَ أَيَّامِي يَوْمَ أَلْقَاكَ فِيهِ ۞

اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً هَنِيَّةً وَمِيتَةً سَوِيَّةً وَمَرَدًّا غَيْرَ مُخْزٍ وَلاَ فَاضِحٍ ۞

اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ المَسْأَلةِ وَخَيْرَ الدُّعَاءِ وَخَيْرَ النَّجَاحِ وَخَيْرَ العِلْمِ وَخَيْرَ العَمَلِ وَخَيْرَ  الثَّوَابِ وَخَيْرَ الحَيَاةِ وَخيْرَ المَمَاتِ وَثَبِّتْنِي وَثَقِّلْ مَوَازِينِي وَحَقِّقْ إِيمَانِي وَارْفَعْ دَرَجَتِي وَتَقَبَّلْ صَلاَتِي وَاغْفِرْ خَطِيئَاتِي وَأَسْأَلُكَ العُلَا مِنَ الجَنَّةِ ۞

اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمِ مَغْفِرَتِكَ وَالسَّلاَمَةَ مِنْ كُلِّ إِثْمٍ وَالغَنِيمَةَ مِنْ كُلِّ بِرٍّ وَالفَوْزَ بِالجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ ۞

اللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الأُمُورِ كُلِّهَا وَأجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ ۞

اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَاتَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعْصِيَتِكَ وَمِنْ طَاعَتِكَ مَاتُبَلِّغُنَا بِهَا جَنَّتَكَ وَمِنَ اليَقِينِ مَاتُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَاأَحْيَيْتَنَا وَاجْعَلْهُ الوَارِثَ مِنَّا وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا وَانْصُرْنَا عَلَى مَنْ عَادَانَا وَلاَ تجْعَلْ مُصِيبَتَنَا فِي دِينِنَا وَلاَ تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلَا مَبْلَغَ عِلْمِنَا وَلاَ تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا ۞

اللَّهُمَّ لَا تَدَعْ لَنَا ذَنْبًا إِلَّا غَفَرْتَهُ وَلَا هَمَّا إِلَّا فَرَّجْتَهُ وَلَا دَيْنًا إِلَّا قَضَيْتَهُ وَلَا حَاجَةً مِنْ حَوَائِجِ الدُّنْيَا وَالآخِرَةِ إِلَّا قَضَيْتَهَا يَاأَرْحَمَ الرَّاحِمِينَ ۞

رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ وَصَلَّى اللهُ عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ وَعَلَى آلِهِ وَأَصْحَابِهِ الأَخْيَارِ وَسَلَّمَ تَسْلِيمًا كَثِيراً.

    ''';