// ignore_for_file: constant_identifier_names

class AppString {
  static const String KAboutText =
      'تطبيق رَفِيقُ المُسْلِمِ اليَوْمِيُ هو رفيق كل مسلم الذي لايمكنك الاستغناء عنه في يومك الذي يجمع بين جمال القرآن الكريم وروعة الأذكار وقوة الأحاديث النبوية ودقة مواقيت الصلاة مع تحديد دقيق لاتجاه القبلة.';
  static const String doneText =
      'المحافظة على ذكر الله تعالى فيها خيرا كثيرا في هذه الحياة وأجرا عظيما في الآخرة، وأذكار الصباح والمساء من أهم الأذكار التي ينبغي للمسلم أن يحافظ عليها. فمن فوائدها انشراح الصدر وطمأنينة القلب ومعية الله تعالى وذكره للعبد في الملأ الأعلى قال الله تعالى: الَّذِينَ آمَنُواْ وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللّهِ أَلاَ بِذِكْرِ اللّهِ تَطْمَئِنُّ الْقُلُوبُ {الرعد:28}.\n وقال رسول الله صلى الله عليه وسلم: يقول الله عز وجل أنا عند ظن عبدي بي، وأنا معه حين يذكرني إن ذكرني في نفسه ذكرته في نفسي، وإن ذكرني في ملأ ذكرته في ملأ هم خير منهم. الحديث رواه مسلم وغيره.';
  static const String KAboutText2 =
      'تطبيق رَفِيقُ المُسْلِمِ اليَوْمِيّ هو أكثر من مجرد تطبيق بل هو صَدَقَةٌ جَارِيَةٌ نُهْدِيهَا عن أُخْتِي الحَبِيبَةِ – رَحِمَهَا اللهُ – وعن كُلِّ أَحِبَّتِنَا الَّذِينَ فَارَقُونَا من المسلمين وعن كُلِّ مَنْ نَشَرَ وَسَاهَمَ وَدَعَا إلى هذا العمل الخيّر لِوَجْهِ اللهِ تَعَالَى نَسْأَلُ اللهَ أَنْ يَجْعَلَهُ نُورًا فِي قُبُورِهِمْ وَأَنْ يَكْتُبَ لَنَا وَلَكُمْ أَجْرَهُ الدَّائِمَ في الدُّنْيَا وَالآخِرَة اللَّهُمَّ اجْعَلْهُ عَمَلًا صَالِحًا لا يَنْقَطِعُ وَبَابًا لِلرَّحْمَةِ وَالْخَيْرِ.';
  static const String KAppRate = 'تقييم التطبيق';
  static const String KAppVersion = 'version : 1.0.0';
  static const String KAppRights =
      'Designed and Developed by Taher Salah ';
  // '\u{1f60e} Designed and Developed by Taher Salah ';

  static const String KPrayerAppBar = 'أذكار بعد الصلاة المكتوبة';
  static const String KAppAbout = 'عن التطبيق';
  static const String KDevlop = 'تطوير';
  static const String KContact = 'تواصل معنا';
  static const String KSadka = 'صدقة جارية';
  static const String Ksabah = 'أذكار الصباح';
  static const String KMessa = 'أذكار المساء';
  static const String KPrayer = 'أذكار الصلاة';
  static const String KSleep = 'أذكار النوم';
  static const String KOtherZakar = 'أذكار مختارة';
  static const String KRokia = 'الرقية الشرعية';
  static const String KCounter = 'المسبحةُ الالكترونية';
  static const String KSabhText = 'سبٌح';
  static const String KRestText = 'إعادة';
  static const String KAbout = 'عنـــــا';
  static const String KAzan = 'مواقيت الصلاة';
  static const String KSabahDaialogText =
      'تهانينا باتمامك وردك اليومي من اذكار الصباح';
  static const String KMessaDaialogText =
      'تهانينا باتمامك وردك اليومي من اذكار المساء';
  static const String KPrayerDaialogText =
      'تهانينا باتمامك وردك اليومي من اذكار الصلاة';
  static const String KSleepDaialogText =
      'تهانينا باتمامك وردك اليومي من اذكار النوم';
  static const String KAzkarDaialogText =
      'تهانينا باتمامك وردك اليومي من الاذكار والادعية';
  static const String KRokiaDaialogText = 'تهانينا باتمامك الرقية الشرعية';
  static const String KForYou = 'تهنئة لك';
  static const String KZakarSabahFeaturesTitle = 'فضل الالتزام باذكار الصباح';
  static const String KZakarMessaFeaturesTitle = 'فضل الالتزام باذكار المساء';
  static const String KZakarPrayerFeaturesTitle = 'فضل الالتزام باذكار الصلاة';
  static const String KZakarFeaturesTitle = 'فضل الالتزام بالاذكار ';
  static const String KZakarSleepFeaturesTitle = 'فضل الالتزام باذكار النوم';
  static const String KRokiaFeaturesTitle = 'فضل الالتزام بالرقية الشرعية';
  static const String KZakarSleepFeaturesDes = """
 أذكار النوم، هي حصن حصين من الشيطان، وتجعل صاحبها في قرب من الله، وتواصل دائم معه، وللنوم آداب شرعية أخرى ينبغي الحرص عليها. والنوم كما هو معروف هو الموتة الصغرى، قال تعالى: {اللَّهُ يَتَوَفَّى الأَنْفُسَ حِينَ مَوْتِهَا وَالَّتِي لَمْ تَمُتْ فِي مَنَامِهَا} [الزمر:٤٢]
  فالمسلم حين يضع جانبه على فراشه يتخيل أن تكون هذه آخر نومة ينامها، فيمكن أن يقبضه الله عز وجل خلال هذا النوم، فيختم حياته ويختم يومه بذكر الله سبحانه وتعالى، ويكون هذا آخر شيء كان عليه، فإذا توفي على ذلك مات على شيء عظيم من ذكر الله سبحانه، وخاصة إذا كان ختم بقراءة قل يا أيها الكافرون، فيموت على براءة من الكفر، فتبرأ من الكفر، وتبرأ من الشرك وأهله، فيموت على خير حال إذا كان يختم له بذلك.
  """;
  static const String KZakarOtherFeaturesDes = """
   ان اهتمام النبي صلى الله عليه وسلم بقضية الذكر، وبيان فضائله المرة تلو الأخرى، روى أبو الدرداء رضي الله عنه أن رسول الله صلى الله عليه وسلم، قال: (ألا أنبئكم بخير أعمالكم وأزكاها عند مليككم, وأرفعها في درجاتكم, وخيرٌ لكم من إنفاق الذهب والوَرِق, وخيرٌ لكم من أن تلقوا عدوكم، فتضربوا أعناقهم، ويضربوا أعناقكم؟)، قالوا: بلى, فقال عليه الصلاة والسلام: (ذكر الله تعالى) رواه الترمذي والحاكم وصححه، و(الوَرِق) هو الفضّة.
وعن عبد الله بن بُسر رضي الله عنه، أن رجلاً قال: يا رسول الله! إن شرائع الإسلام قد كَثُرت عليَّ، فأخبرني بشيء أتشبث به، فقال عليه الصلاة والسلام: (لا يزال لسانك رطباً من ذكر الله) رواه الترمذي وابن ماجه.
واللسان الغافل عن ذكر الله تعالى كاليد الشلاّء، أو العين العمياء، أو الأذن الصمّاء: أعضاءٌ مُعطّلة عن فعل ما خُلقت لأجله، فكيف تستنير بصيرةٌ إن لم يكن لها من مدد القلوب وغِياثُها؟ ولذلك وصف العلماء الذكر للقلب بالقوت: متى حُرمت الأجساد منه صارت قبوراً, وجعلوه بمثابة السلاح الذي يقاتل أصحابه قطّاع الطريق, والماء الذي يطفئون به نار الحريق, ودواء الأسقام الذي متى فارقهم انتكست منهم القلوب, فضلاً عن كونه السبب الواصل والعلاقة التي كانت بينهم وبين علاّم الغيوب.
وقد جاء في القرآن الكريم التوكيد والتأكيد على أهميّة الذكر ودوره في تحقيق النصر، في أحلك الظروف وأشدها، حين تقارع السيوف، وتطاير الرؤوس، وارتفاع غبار المعارك، ليكون ذكرُ الله تعالى في تلك اللحظات الحرجة مدداً من السماء، يحصل من خلاله ثبات القلب وطمأنينته، قال الله تعالى: {يا أيها الذين آمنوا إذا لقيتم فئة فاثبتوا واذكروا الله كثيرا لعلكم تفلحون} (الأنفال:45).
ومن مَكرُمات الذكر أن الله سبحانه وتعالى يُظهر فضل عبيده الذاكرين ويُبيّن مكانتهم العظيمة لملائكته الكرام، روى أبو سعيد الخدري رضي الله عنه أن رسول الله صلى الله عليه وسلم خرج على حلقة من أصحابه، فقال: (ما أجلسكم؟) قالوا: جلسنا نذكر الله, ونحمده على ما هدانا للإسلام، ومنَّ به علينا، قال: (آلله ما أجلسكم إلا ذاك؟) قالوا: والله ما أجلسنا إلا ذاك, قال: (أما إني لم أستحلفكم تهمة لكم, ولكنه أتاني جبريل عليه السلام, فأخبرني أن الله عز وجل يباهي بكم الملائكة) رواه مسلم.
وأصحاب مجالس الذكر اختصّهم الله سبحانه وتعالى بفضائل أربعة: تنزل الطمأنينة، وغشيان الرحمة، وإحاطة الملائكة بهم، وذِكْرِهم في الملأ الأعلى، وهذه الفضائل مذكورةٌ في حديث أبي هريرة وأبي سعيد الخدري رضي الله عنهما أن النبي صلى الله عليه وسلم، قال: (لا يقعد قوم يذكرون الله عز وجل إلا حفتهم الملائكة، وغشيتهم الرحمة، ونزلت عليهم السكينة، وذكرهم الله فيمن عنده) رواه مسلم.
وكما أنّ ذكر الله سبحانه وتعالى هو نداء الفطرة، وانقيادٌ للشرع، فإنه كذلك مقتضى العقل؛ فإن المرء يجد في نفسه ضرورةً إلى المداومة على الاشتغال بالذكر؛ لترتاح نفسه، وتطمئن من أمراضها وأدوائها المختلفة، قال الله سبحانه وتعالى: {ألا بذكر الله تطمئن القلوب} (الرعد: 28)، وقد أنشد بعضهم في ذلك قائلاً:

                                                   إذا مرضنا تداوينا بذكركمُ         ونترك الذكر أحيانًا فننتكس

وقد مدح الله سبحانه وتعالى الذاكرين ووصفهم بما يدلّ على رجاحة عقولهم فقال: {إن في خلق السموات والأرض واختلاف الليل والنهار لأيات لأولي الألباب * الذين يذكرون الله قياما وقعودا وعلى جنوبهم ويتفكرون في خلق السموات والأرض ربنا ما خلقت هذا باطلا سبحانك فقنا عذاب النار} (آل عمران:190-191).
وطوبى لمن أشغله ذِكْرُ الله عزّ وجل عن كلّ ما سواه، أولئك الذين قال الله فيهم: {والذاكرين الله كثيرا والذاكرات أعد الله لهم مغفرة وأجرا عظيما} (الأحزاب:35)، وهم من سماهم الرسول صلى الله عليه وسلم بالمفرِّدين، فقال: (سبق المفردون)، قالوا: وما المفردون يا رسول الله؟! قال: (الذاكرون الله كثيراً، والذاكرات) رواه مسلم.
  """;
  static const String KZakarPrayerFeaturesDes = """
 سببا من أسباب دخول الجنة وتكفير السيئات، فقراءة آية الكرسي عقب الصلاة سبب لدخول الجنة؛ كما يدل عليه حديثُ أَبِي أُمَامَةَ ـ رضي الله عنه ـ قَالَ: قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم: «مَنْ قَرَأَ آيَةَ الْكُرْسِيِّ دُبُرَ كُلِّ صَلَاةٍ مَكْتُوبَةٍ لَمْ يَمْنَعْهُ مِنْ دُخُولِ الْجَنَّةِ إِلَّا الْمَوْتُ». رَوَاهُ النَّسَائِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ وَزَادَ فِيهِ الطَّبَرَانِيُّ: «وَقُلْ هُوَ اللَّهُ أَحَدٌ» كذا في بلوغ المرام للحافظ ابن حجر.
والتسبيح والتحميد والتكبير عقب الصلاة سبب لمغفرة الخطايا؛ كما يدل عليه حديث أَبِي هُرَيْرَةَ ـ رضي الله عنه ـ عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ: «مَنْ سَبَّحَ اللَّهَ دُبُرَ كُلِّ صَلَاةٍ ثَلَاثًا وَثَلَاثِينَ, وَحَمِدَ اللَّهِ ثَلَاثًا وَثَلَاثِينَ, وَكَبَّرَ اللَّهُ ثَلَاثًا وَثَلَاثِينَ, فَتِلْكَ تِسْعٌ وَتِسْعُونَ, وَقَالَ تَمَامَ الْمِائَةِ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ, لَهُ الْمُلْكُ, وَلَهُ الْحَمْدُ, وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ, غُفِرَتْ لَهُ خَطَايَاهُ, وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ». رَوَاهُ مُسْلِمٌ، وغيرها من الأذكار الواردة عقب الصلاة والتي يشرع أن تقال بعد الصلاة مباشرة 
  """;
  static const String KZakarRokiaFeaturesDes = """
   لا بأس أن يرقي المسلم نفسه فذلك مباح له بل هو سنة حسنة فقد رقى الرسول صلى الله عليه وسلم نفسه ، ورقى بعض أصحابه أنفسهم .
عن عائشة رضي الله عنها : " أن رسول الله صلى الله عليه وسلم كان إذا اشتكى يقرأ على نفسه بالمعوذات وينفث فلما اشتد وجعه كنت أقرأ عليه وأمسح بيده رجاء بركتها ". رواه البخاري ( 4728 ) ومسلم ( 2192 ) .
وأما الحديث الذى رواه مسلم ( 220 ) عن النبي صلى الله عليه وسلم في صفة السبعين ألفاً الذين سيدخلون الجنة من هذه الأمة بغير حساب ولا عذاب قال : ( هم الذين لا يرقون ولا يسترقون ولا يتطيرون وعلى ربهم يتوكلون )
فقوله ( لا يرقون ) وهم من الراوي لم يقله النبي صلى الله عليه وسلم ، ولذلك روى البخاري هذا الحديث برقم ( 5420 ) ولم يذكر فيه هذا اللفظ .
قال شيخ الإسلام ابن تيمية ـ رحمه الله ـ :
فمدح هؤلاء بأنهم لا يسترقون أي لا يطلبون من أحد أن يرقيهم والرقية من جنس الدعاء فلا يطلبون من أحد ذلك وقد روي فيه "ولا يرقون" وهو غلط ؛ فإن رقياهم لغيرهم ولأنفسهم حسنة وكان النبي صلى الله عليه وسلم يرقي نفسه وغيره لم يكن يسترقي ؛ فإن رقية نفسه وغيره من جنس الدعاء لنفسه وغيره وهذا مأمور به ؛ فإن الأنبياء كلهم سألوا الله ودعوه كما ذكر الله ذلك في قصة آدم وإبراهيم و موسى و غيرهم اهـ . مجموع الفتاوى (1 / 182).
قال ابن القيم رحمه الله :
وهذه اللفظة وقعت مقحمة في الحديث وهي غلط من بعض الرواة اهـ . حادي الأرواح ( 1 / 89 )
والرقية من أعظم الأدوية التي ينبغي للمؤمن المحافظ عليها 
  """;
  static const String KZakarTime = """
  وقت الصباح يبدأ من نصف الليل الأخير إلى الزوال، وأفضل وقت لأذكار الصباح الإتيان بها من بعد صلاة الصبح حتّى تطلع الشمس، كما أنّ وقت المساء يبدأ من زوال الشمس إلى نهاية نصف الليل الأول، وأفضل وقتٍ لقراءتها من بعد صلاة العصر حتّى تغرب الشمس.
  """;
  static const String KFadlZakar = 'فضل الذكر';
  static const String KDone = 'تـــــم';
  static const String KLocation = 'تحديد المواقيت تلقائياً';
  static const String kmUS = 'تحديد المواقيت تلقائياً';

  static const String KSplashHadith =
      '(سبَق المُفرِّدونَ سبَق المُفرِّدونَ )\n قالوا : يا رسولَ اللهِ ما المُفرِّدونَ ؟ \n قال :( الذَّاكرونَ اللهَ كثيرًا والذَّاكراتُ)';
}
